from base import addDescription
from base import showUsers

def beginQuestButton(): pass

def beginQuest(): pass

def showGuideBook():
	return "Sap"

def userComp():
	return f"""
	Кампания GameProgramm начала свою существование в 1987 году, 
	когда наш основатель Дмитрий Чингвинцев, работая на Заводе Электроники 
	«Звезда» заинтересовался играми. Перва игра вышедшея в 1989 году нашей 
	кампании стала «Filler» в который с радостью играли офисные работники 
	во время перерывов (а может и не только во время их). К сожалению из-за 
	проблем авторских прав наша кампания потеряла права на владение «Filler», 
	но не стоит расстраиваться так как нас ждало еще много новых проектов, 
	как на аутсорсе для крупных игроков рынка, так и собственных 
	"""

def userWork1():
	return f"""
		Все мы когда-то начанали с низов, у нас было много вопросов и 
		постоянно докучали ими всех. Чтобы больше таких казусов не случалось 
		наша кампания создала этого телеграмм бота чтобы помочь новым сотрудникам 
		по типу ТЕБЯ.
	"""

'''Пройдя по ниже соответствующим кнопкам и нажав на одну из них 
		ты узнаешь больше информации.'''

def userWork2():
	return f"""
		Ваша программа будет иметь следующие критерии оценки:

	Работоспособность - насколько программа хорошо работает (работает ли она без зависаний и/или вылетов)

	Удобный интерфейс - удобный UI/UX интерфейс является огромной частью программы, можно ли его использовать без соответсвующей документации? Достаточно ли он Юзер-Фредли?

	Время производства - быстрый результат является одним из важнейших пунктов в оценке, хотелось бы чтобы приложение было готово в кратчайшие сроки
	"""

def showColleges():
	pass
